[
  {
    "id": 1,
    "displayName": "Fundamentals Of Graphic Design",
    "description": "Do you want to learn all the skills and techniques you need to create incredible designs? Do you want to know the process of creating logos and branding packages? Are you intimidated by learning photoshop, illustrator or InDesign and want to learn through practical real world projects? Than This class will be for you! We will extensively review Typography, color theory, layout and composition, how to use photos in design, photo manipulations and editing and magazine layout design, branding and logo design just to name a few.We also learn the basics of Adobe Photoshop, illustrator and InDesign and do projects with real world applications. Every designer needs to know and master these programs and this course makes sure you know the essential tools to power through amazing projects.In Adobe Photoshop, we will review photo editing and manipulation techniques like how to cut objects out, duotones, changing color on objects, the liquify tool and we will create a compelling YouTube thumbnail with our newly learned photoshop skills as well as an entire book cover design project.In Adobe Illustrator, we will master the pen tool by hand tracing simple and complex shapes. We will explore the power of the shape builder tool and In the end of this section, we will design a complete logo design. There is an entirely new introduction and tools section that has been added where we work through a 7 page vector tracing worksheet and in the end create a complex vector illustration using our newly learned illustrator vector tools. Lastly, we will put together an event flyer to practice our layout skills, and even work through the branding process and create a logo, business card and letterhead for a business.We will will create a magazine layout in InDesign and learn the master pages tool to drastically speed up your design workflow when working with multiple paged layouts. We will talk about branding basics, what makes a good logo? How do you extend your logo or brand to other marketing materials? I designed this extensive course to be gentle enough for new comers to design but detailed enough for everyone to get a TON out of this course.New Mini-Course Added! Discover Your Design Niche! Do you want to find out what design niche you should concentrate on? This is an exploratory mini-class added to the Graphic Design Masterclass course on Udemy (Section 15) that helps you find your next focus and explore many wonderful options for budding and established designers.We are going to review some main core design categories and talk about what types of projects you will do and also what you will need to learn to leap into those design niches.There are always more niches to discover but we will focus on the following in this mini-class:Logo Design, Print & Editorial Design, Pattern Design and Illustration, Package Design, Branding Design, UX/UI Design,Social Media/Digital Graphic Designer.",
    "price": 195,
    "old_price": 280,
    "rating": 5.0,
    "img": "https://i.ibb.co/8m1qCGr/3533582.jpg",
    "level": "Beginer",
    "class_length": 24,
    "enrolled": 258,
    "last_update": "July 24, 2022",
    "author": "Timmy McGinn"
  },
  {
    "id": 2,
    "displayName": "Digital Marketing: How to Generate Sales Leads",
    "description": "Join 500,000+ students in the best-selling digital marketing course on Udemy!With over 20 hours of training, quizzes and practical steps you can follow - this is one of the most comprehensive digital marketing courses available. We'll cover SEO, YouTube Marketing, Facebook Marketing, Google Adwords, Google Analytics and more! Learn By Doing. The course is hugely interactive with projects, checklists & actionable lectures built into every section.Learn step by step how to market a business online from scratch across all the major marketing channels.Follow the steps on screen to get results at work, for own business or for your digital marketing clients.12 Courses in 1 Covering 12 major online marketing topics and comprising of 20+ hours of clear cut lectures & practice activities - this course is as one student said. We'll cover:Market Research. Ask 3 simple questions to validate your business idea.WordPress. Build a world-class website in 1 hour without any coding.Email Marketing. Build a mailing list of 1000 people in 30 days from scratch. Copywriting. Write sales pages that make the cash register ring!SEO (Search Engine Optimisation). Get free traffic to your website with SEO.YouTube Marketing. Drive traffic & sales with simple  videos.Social Media Marketing (Instagram, Facebook, Twitter, Pinterest & Quora).Linkedin Marketing. Go viral on Linkedin and 400x your connections.App Marketing. Discover 43 Ways To Promote Your App.Google Adwords. Avoid common mistakes and set up profitable campaigns first time.Facebook Ads. Make money with Facebook Ads without spending a fortune.Google Analytics. Improve your marketing with Google Analytics data.By the end of this course, you will be confidently implementing marketing strategies across the major online marketing channels.All the strategies, tips and tools recommended are either free or very cost effective.",
    "price": 138,
    "old_price": 230,
    "rating": 5.0,
    "img": "https://i.ibb.co/SXwBQ1d/1726.jpg",
    "level": "Beginer",
    "class_length": 23,
    "enrolled": 224,
    "last_update": "February 16, 2022",
    "author": "Andrej Ryley"
  },
  {
    "id": 3,
    "displayName": "The Web Developer Bootcamp 2022",
    "description": "Hi! Welcome to the brand new version of The Web Developer Bootcamp, Udemy's most popular web development course.  This course was just completely overhauled to prepare students for the 2022 job market, with over 60 hours of brand new content. This is the only course you need to learn web development. There are a lot of options for online developer training, but this course is without a doubt the most comprehensive and effective on the market.  Here's why:This is the only Udemy course taught by a professional bootcamp instructor with a track record of success.94% of my in-person bootcamp students go on to get full-time developer jobs. Most of them are complete beginners when I start working with them.The previous 2 bootcamp programs that I taught cost $14,000 and $21,000.  This course is just as comprehensive but with brand new content for a fraction of the price.Everything I cover is up-to-date and relevant to 2022's developer job market. This course does not cut any corners. I just spent 8 months redoing this behemoth of a course!We build 13+ projects, including a gigantic production application called YelpCamp. No other course walks you through the creation of such a substantial application.The course is constantly updated with new content, projects, and modules.  Think of it as a subscription to a never-ending supply of developer training.You get to meet my cats and chickens!When you're learning to program you often have to sacrifice learning the exciting and current technologies in favor of the  classes.  With this course, you get the best of both worlds.  This is a course designed for the complete beginner, yet it covers some of the most exciting and relevant topics in the industry.Throughout the brand new version of the course we cover tons of tools and technologies including:HTML5,CSS3,Flexbox,Responsive Design,JavaScript (all 2022,modern syntax, ES6, ES2018, etc.),Asynchronous JavaScript - Promises, async/await, etc.,AJAX and single page apps,Bootstrap 4 and 5 (alpha),SemanticUI,Bulma CSS Framework,DOM ManipulationUnix(Command Line) CommandsNodeJSNPMExpressJSTemplatingRESTSQL vs. NoSQL databases MongoDB Database Associations Schema Design Mongoose Authentication From Scratch Cookies & Sessions Authorization Common Security Issues - SQL Injection, XSS, etc. Developer Best Practices Deploying Apps Cloud Databases Image Upload and Storage Maps and Geocoding",
    "price": 107,
    "old_price": 180,
    "rating": 5.0,
    "img": "https://i.ibb.co/zNLjYbk/professional-programmer-working-late-dark-office.jpg",
    "level": "Intermediate",
    "class_length": 16,
    "enrolled": 276,
    "last_update": "September 09, 2022",
    "author": "Margaux Nutbeem"
  },
  {
    "id": 4,
    "displayName": "Master Digital Design: UX Research & UI Design",
    "description": "Just updated with all modern Design tools and best practices for 2022! Join a live online community of over 600,000+ students and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto for top companies. A great Designer is becoming harder and harder to find and it isn't rare to find designers make $160,000+ salaries now because it is such a valuable skill. We will teach you how to get there! Using the latest best practices in Web Design and Mobile Design as well as User Interface and User Experience Design (UI/UX), this course focuses on efficiently getting you from zero to a point where you can get hired or win freelance contracts. We will use in demand tools like Figma to show you a full workflow from start to finish. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. The course also includes 100+ assets and premium design templates that you can keep and use to customize for all your future projects. We guarantee you this is the most comprehensive online resource on Design skills! The curriculum is going to be very hands on as we walk you from start to finish of working as a Designer, all the way into learning how to create final professional designs and then converting them into actual websites or apps using HTML and CSS. ",
    "price": 153,
    "old_price": 190,
    "rating": 5.0,
    "img": "https://i.ibb.co/ftXxcJf/5778864.jpg",
    "level": "Beginer",
    "class_length": 20,
    "enrolled": 226,
    "last_update": "August 13, 2022",
    "author": "Cally Maddrah"
  },
  {
    "id": 5,
    "displayName": "Mastering The Data Science Course 2022",
    "description": "Interested in the field of Machine Learning? Then this course is for you! This course has been designed by two professional Data Scientists so that we can share our knowledge and help you learn complex theory, algorithms, and coding libraries in a simple way. We will walk you step-by-step into the World of Machine Learning. With every tutorial, you will develop new skills and improve your understanding of this challenging yet lucrative sub-field of Data Science.This course is fun and exciting, but at the same time, we dive deep into Machine Learning. It is structured the following way: Part 1 - Data Preprocessing Part 2 - Regression: Simple Linear Regression, Multiple Linear Regression, Polynomial Regression, SVR, Decision Tree Regression, Random Forest Regression Part 3 - Classification: Logistic Regression, K-NN, SVM, Kernel SVM, Naive Bayes, Decision Tree Classification, Random Forest Classification Part 4 - Clustering: K-Means, Hierarchical Clustering Part 5 - Association Rule Learning: Apriori, Eclat Part 6 - Reinforcement Learning: Upper Confidence Bound, Thompson Sampling Part 7 - Natural Language Processing: Bag-of-words model and algorithms for NLP Part 8 - Deep Learning: Artificial Neural Networks, Convolutional Neural Networks Part 9 - Dimensionality Reduction: PCA, LDA, Kernel PCA Part 10 - Model Selection & Boosting: k-fold Cross Validation, Parameter Tuning, Grid Search, XGBoost Moreover, the course is packed with practical exercises that are based on real-life examples. So not only will you learn the theory, but you will also get some hands-on practice building your own models. And as a bonus, this course includes both Python and R code templates which you can download and use on your own projects.",
    "price": 183,
    "old_price": 241,
    "rating": 5.0,
    "img": "https://i.ibb.co/Ny1R0jw/rsz-businesswoman-using-tablet-analysis-graph-company-finance-strategy-statistics-success-concept-pl.jpg",
    "level": "Advanced",
    "class_length": 17,
    "enrolled": 297,
    "last_update": "June 20, 2022",
    "author": "Tedie Alennikov"
  },
  {
    "id": 6,
    "displayName": "Complete Machine Learning Bootcamp 2022",
    "description": "Machine Learning and artificial intelligence (AI) is everywhere; if you want to know how companies like Google, Amazon, and even Udemy extract meaning and insights from massive data sets, this data science course will give you the fundamentals you need. Data Scientists enjoy one of the top-paying jobs, with an average salary of $120,000 according to Glassdoor and Indeed. That's just the average! And it's not just about money - it's interesting work too! If you've got some programming or scripting experience, this course will teach you the techniques used by real data scientists and machine learning practitioners in the tech industry - and prepare you for a move into this hot career path. This comprehensive machine learning tutorial includes over 100 lectures spanning 15 hours of video, and most topics include hands-on Python code examples you can use for reference and for practice. I’ll draw on my 9 years of experience at Amazon and IMDb to guide you through what matters, and what doesn’t. Each concept is introduced in plain English, avoiding confusing mathematical notation and jargon. It’s then demonstrated using Python code you can experiment with and build upon, along with notes you can keep for future reference. You won't find academic, deeply mathematical coverage of these algorithms in this course - the focus is on practical understanding and application of them. At the end, you'll be given a final project to apply what you've learned! There's also an entire section on machine learning with Apache Spark, which lets you scale up these techniques to big data analyzed on a computing cluster. If you're new to Python, don't worry - the course starts with a crash course. If you've done some programming before, you should pick it up quickly. This course shows you how to get set up on Microsoft Windows-based PC's, Linux desktops, and Macs.If you’re a programmer looking to switch into an exciting new career track, or a data analyst looking to make the transition into the tech industry – this course will teach you the basic techniques used by real-world industry data scientists. These are topics any successful technologist absolutely needs to know about, so what are you waiting for? Enroll now!",
    "price": 195,
    "old_price": 260,
    "rating": 5.0,
    "img": "https://i.ibb.co/3YsYGx7/849.jpg",
    "level": "Advanced",
    "class_length": 16,
    "enrolled": 271,
    "last_update": "17 Aug 2022",
    "author": "Hinze Hollebon"
  }
]
